Revit 2024 API
IFCProductWrapper.AddBuilding Method
 Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void AddBuilding(
	IFCAnyHandle buildingHandle
)
Visual Basic
Public Sub AddBuilding ( _
	buildingHandle As IFCAnyHandle _
)
Visual C++
public:
void AddBuilding(
	IFCAnyHandle^ buildingHandle
)
Parameters
buildingHandle
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The IfcBuilding handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace